export class IconUtility {
  value: string;
  displayText: string;
  icon: string;
  checked?: boolean;
  isPrivate?: boolean ;
}

export const IconUtilityList: IconUtility[] = [
  {
    value: 'Wifi',
    displayText: 'Wifi',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="30.444" height="21.522"
        viewBox="0 0 30.444 21.522">
        <path id="ic_wifi_24px"
            d="M1,10.747l2.768,2.768a17.615,17.615,0,0,1,24.909,0l2.768-2.768A21.54,21.54,0,0,0,1,10.747ZM12.071,21.818l4.151,4.151,4.151-4.151A5.863,5.863,0,0,0,12.071,21.818ZM6.535,16.283,9.3,19.05a9.789,9.789,0,0,1,13.838,0l2.768-2.768A13.714,13.714,0,0,0,6.535,16.283Z"
            transform="translate(-1 -4.448)" />
    </svg>`,
  },
  {
    value: 'Pool',
    displayText: 'Hồ bơi',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="27.677" height="25.689" viewBox="0 0 27.677 25.689">
        <g id="ic_pool_24px" transform="translate(0 0)">
            <path id="Path_100" data-name="Path 100"
                d="M29.677,27.909a5.293,5.293,0,0,1-3.017-.886,2.6,2.6,0,0,0-1.591-.5,2.485,2.485,0,0,0-1.591.5,5.581,5.581,0,0,1-6.033,0,2.6,2.6,0,0,0-1.591-.5,2.485,2.485,0,0,0-1.591.5,5.384,5.384,0,0,1-3.031.886,5.293,5.293,0,0,1-3.017-.886,2.512,2.512,0,0,0-1.591-.5,2.512,2.512,0,0,0-1.591.5A5.384,5.384,0,0,1,2,27.909V25.141a2.485,2.485,0,0,0,1.591-.5,5.384,5.384,0,0,1,3.031-.886,5.293,5.293,0,0,1,3.017.886,2.485,2.485,0,0,0,1.591.5,2.485,2.485,0,0,0,1.591-.5,5.385,5.385,0,0,1,3.031-.886,5.293,5.293,0,0,1,3.017.886,2.6,2.6,0,0,0,1.591.5,2.513,2.513,0,0,0,1.591-.5,5.581,5.581,0,0,1,6.033,0,2.485,2.485,0,0,0,1.591.5Zm0-6.227A5.293,5.293,0,0,1,26.66,20.8a2.6,2.6,0,0,0-1.591-.5,2.485,2.485,0,0,0-1.591.5,5.581,5.581,0,0,1-6.033,0,2.6,2.6,0,0,0-1.591-.5,2.485,2.485,0,0,0-1.591.5,5.293,5.293,0,0,1-3.017.886A5.293,5.293,0,0,1,8.227,20.8a2.6,2.6,0,0,0-1.591-.5,2.513,2.513,0,0,0-1.591.5A5.477,5.477,0,0,1,2,21.682V18.914a2.485,2.485,0,0,0,1.591-.5,5.293,5.293,0,0,1,3.017-.886,5.293,5.293,0,0,1,3.017.886,2.6,2.6,0,0,0,1.591.5,2.485,2.485,0,0,0,1.591-.5,5.293,5.293,0,0,1,3.017-.886,5.293,5.293,0,0,1,3.017.886,2.6,2.6,0,0,0,1.591.5,2.513,2.513,0,0,0,1.591-.5,5.581,5.581,0,0,1,6.033,0,2.6,2.6,0,0,0,1.591.5v2.768ZM11.23,15.455a2.485,2.485,0,0,0,1.591-.5,5.385,5.385,0,0,1,3.031-.886,5.293,5.293,0,0,1,3.017.886,2.6,2.6,0,0,0,1.591.5,2.513,2.513,0,0,0,1.591-.5c.166-.1.36-.208.567-.318l-8.884-8.87C11.59,3.623,9.611,2.986,6.151,3V6.46a6.809,6.809,0,0,1,5.535,2.076l1.384,1.384-4.5,4.5a7.572,7.572,0,0,1,1.066.54A2.485,2.485,0,0,0,11.23,15.455Z"
                transform="translate(-2 -2.22)" />
            <ellipse id="Ellipse_22" data-name="Ellipse 22" cx="4.028" cy="3.524" rx="4.028" ry="3.524"
                transform="translate(15.88 0)" />
        </g>
    </svg>`,
  },
  {
    value: 'Gym',
    displayText: 'Gym',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="27.677" height="27.677" viewBox="0 0 27.677 27.677">
        <path id="ic_fitness_center_24px"
            d="M27.7,19.8l1.979-1.979L27.7,15.838l-4.94,4.94L10.9,8.919l4.94-4.94L13.859,2,11.881,3.979,9.9,2,6.94,4.961,4.961,2.983,2.983,4.961,4.961,6.94,2,9.9l1.979,1.979L2,13.859l1.979,1.979,4.94-4.94L20.779,22.757l-4.94,4.94,1.979,1.979L19.8,27.7l1.979,1.979,2.961-2.961,1.979,1.979,1.979-1.979-1.979-1.979,2.961-2.961Z"
            transform="translate(-2 -2)" />
    </svg>`,
  },
  {
    value: 'ShuttleBus',
    displayText: 'Xe đưa đón',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="30.444" height="19.374" viewBox="0 0 30.444 19.374">
        <path id="ic_airport_shuttle_24px"
            d="M23.141,5H3.768A2.767,2.767,0,0,0,1,7.768V20.222H3.768a4.151,4.151,0,0,0,8.3,0h7.611a4.151,4.151,0,0,0,8.3,0h3.46V13.3ZM3.768,13.3V7.768H9.3V13.3ZM7.919,22.3a2.076,2.076,0,1,1,2.076-2.076A2.073,2.073,0,0,1,7.919,22.3ZM17.606,13.3H12.071V7.768h5.535ZM23.833,22.3a2.076,2.076,0,1,1,2.076-2.076A2.073,2.073,0,0,1,23.833,22.3ZM20.374,13.3V7.768h1.384L27.293,13.3Z"
            transform="translate(-1 -5)" />
    </svg>`,
  },
  {
    value: 'Bar',
    displayText: 'Quán Bar',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="24.909" height="24.909" viewBox="0 0 24.909 24.909">
        <path id="ic_local_bar_24px"
            d="M27.909,5.768V3H3V5.768L14.071,18.222v6.919H7.151v2.768H23.757V25.141H16.838V18.222ZM9.13,8.535,6.681,5.768H24.242L21.779,8.535Z"
            transform="translate(-3 -3)" />
    </svg>`,
  },
  {
    value: 'Tv',
    displayText: 'Tivi',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="29.795" height="24.378" viewBox="0 0 29.795 24.378">
        <path id="ic_tv_24px"
            d="M28.086,3H3.709A2.717,2.717,0,0,0,1,5.709V21.96a2.717,2.717,0,0,0,2.709,2.709H10.48v2.709H21.315V24.669h6.772a2.705,2.705,0,0,0,2.7-2.709l.014-16.252A2.717,2.717,0,0,0,28.086,3Zm0,18.96H3.709V5.709H28.086Z"
            transform="translate(-1 -3)" />
    </svg>`,
  },
  {
    value: 'Breakfast',
    displayText: 'Bữa sáng',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="27.677" height="19.374" viewBox="0 0 27.677 19.374">
        <path id="ic_room_service_24px"
            d="M2,21.606H29.677v2.768H2ZM18.385,8.861a2.855,2.855,0,0,0,.221-1.093,2.768,2.768,0,0,0-5.535,0,2.855,2.855,0,0,0,.221,1.093A12.471,12.471,0,0,0,3.384,20.222H28.293A12.471,12.471,0,0,0,18.385,8.861Z"
            transform="translate(-2 -5)" />
    </svg>`,
  },
  {
    value: 'Golf',
    displayText: 'Golf',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="23.531" height="27.677" viewBox="0 0 23.531 27.677">
        <g id="ic_golf_course_24px" transform="translate(0)">
            <ellipse id="Ellipse_26" data-name="Ellipse 26" cx="1.853" cy="1.853" rx="1.853" ry="1.853"
                transform="translate(19.825 22.576)" />
            <path id="Path_105" data-name="Path 105"
                d="M21.99,7.425,10.919,2V26.909H8.151V24.515C5.674,25,4,25.885,4,26.909c0,1.522,3.723,2.768,8.3,2.768s8.3-1.245,8.3-2.768c0-1.37-2.989-2.5-6.919-2.726V11.659l8.3-4.235Z"
                transform="translate(-4 -2)" />
        </g>
    </svg>`,
  },
  {
    value: 'FreeParking',
    displayText: 'Bãi đậu xe miễn phí',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="20.026" height="27.729" viewBox="0 0 20.026 27.729">
        <path id="ic_local_parking_24px"
            d="M16.783,3H6V30.729h6.162V21.486h4.621A9.243,9.243,0,1,0,16.783,3Zm.308,12.324h-4.93V9.162h4.93a3.081,3.081,0,1,1,0,6.162Z"
            transform="translate(-6 -3)" />
    </svg>`,
  },
  {
    value: 'AirConditional',
    displayText: 'Điều hòa',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="20.051" height="20.051" viewBox="0 0 20.051 20.051">
        <path id="ic_ac_unit_24px"
            d="M22.051,11.023H17.871l3.248-3.248L19.705,6.351l-4.672,4.672H13.028V9.018L17.7,4.346,16.277,2.932,13.028,6.181V2H11.023V6.181L7.775,2.932,6.351,4.346l4.672,4.672v2.005H9.018L4.346,6.351,2.932,7.775l3.248,3.248H2v2.005H6.181L2.932,16.277,4.346,17.7l4.672-4.672h2.005v2.005L6.351,19.705l1.424,1.414,3.248-3.248v4.181h2.005V17.871l3.248,3.248L17.7,19.705l-4.672-4.672V13.028h2.005L19.705,17.7l1.414-1.424-3.248-3.248h4.181Z"
            transform="translate(-2 -2)" />
    </svg>`,
  },
  {
    value: 'LaundryService',
    displayText: 'Dịch vụ giặt là',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="25.384" height="20.096" viewBox="0 0 25.384 20.096">
        <g id="Group_350" data-name="Group 350" transform="translate(-0.001 0)">
            <g id="Group_349" data-name="Group 349" transform="translate(0.001 0)">
                <g id="Group_348" data-name="Group 348">
                    <path id="Path_1287" data-name="Path 1287"
                        d="M206.807,53.333h-13.75A1.058,1.058,0,0,0,192,54.391v1.058a1.058,1.058,0,0,0,1.058,1.058h11.634v2.115h3.173V54.391A1.058,1.058,0,0,0,206.807,53.333Z"
                        transform="translate(-182.481 -53.333)" />
                    <path id="Path_1288" data-name="Path 1288"
                        d="M0,417.058a1.058,1.058,0,0,0,1.058,1.058H24.326a1.058,1.058,0,0,0,1.058-1.058V416H0Z"
                        transform="translate(0 -398.02)" />
                    <path id="Path_1289" data-name="Path 1289"
                        d="M0,191.91H25.384V181.333H10.577A10.588,10.588,0,0,0,0,191.91Zm22.211-4.231a1.058,1.058,0,1,1-1.058,1.058A1.058,1.058,0,0,1,22.211,187.679Zm-4.231,0a1.058,1.058,0,1,1-1.058,1.058A1.058,1.058,0,0,1,17.98,187.679Zm-4.231,0a1.058,1.058,0,1,1-1.058,1.058A1.058,1.058,0,0,1,13.75,187.679Z"
                        transform="translate(0 -174.987)" />
                </g>
            </g>
        </g>
    </svg>`,
  },
  {
    value: 'FireWarning',
    displayText: 'Cảnh báo cháy',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="27.439" height="27.439" viewBox="0 0 27.439 27.439">
        <g id="Group_351" data-name="Group 351" transform="translate(0 0)">
            <path id="Path_1290" data-name="Path 1290"
                d="M241.8,362a.8.8,0,0,0-.8.8v1.608a.8.8,0,1,0,1.608,0V362.8A.8.8,0,0,0,241.8,362Z"
                transform="translate(-228.085 -342.6)" />
            <path id="Path_1291" data-name="Path 1291"
                d="M241.8,452a.8.8,0,0,0-.8.8v1.608a.8.8,0,1,0,1.608,0V452.8A.8.8,0,0,0,241.8,452Z"
                transform="translate(-228.085 -427.777)" />
            <path id="Path_1292" data-name="Path 1292"
                d="M302.372,362.236a.8.8,0,1,0-1.137,1.137l1.137,1.137a.8.8,0,0,0,1.137-1.137Z"
                transform="translate(-284.869 -342.601)" />
            <path id="Path_1293" data-name="Path 1293"
                d="M366.012,425.875a.8.8,0,0,0-1.137,1.137l1.137,1.137a.8.8,0,0,0,1.137-1.137Z"
                transform="translate(-345.098 -402.829)" />
            <path id="Path_1294" data-name="Path 1294"
                d="M161.16,362.236l-1.137,1.137a.8.8,0,0,0,1.137,1.137l1.137-1.137a.8.8,0,1,0-1.137-1.137Z"
                transform="translate(-151.224 -342.6)" />
            <path id="Path_1295" data-name="Path 1295"
                d="M97.52,425.875l-1.137,1.137a.8.8,0,0,0,1.137,1.137l1.137-1.137a.8.8,0,1,0-1.137-1.137Z"
                transform="translate(-90.995 -402.829)" />
            <path id="Path_1296" data-name="Path 1296"
                d="M26.635,0H.8a.8.8,0,1,0,0,1.608H6.485V4.019a.8.8,0,0,0,.8.8h.8V7.342a4.026,4.026,0,0,0,3.215,3.938v1.827A2.415,2.415,0,0,0,9.7,15.381v1.608a.8.8,0,0,0,.8.8h6.431a.8.8,0,0,0,.8-.8V15.381a2.415,2.415,0,0,0-1.608-2.273V11.28a4.026,4.026,0,0,0,3.215-3.938V4.823h.8a.8.8,0,0,0,.8-.8V1.608h5.681a.8.8,0,0,0,0-1.608ZM9.7,7.342V4.823h3.215V8.146h-.8a.8.8,0,0,0-.8.8v.666A2.415,2.415,0,0,1,9.7,7.342Zm8.039,0a2.415,2.415,0,0,1-1.608,2.273V8.95a.8.8,0,0,0-.8-.8h-.8V4.823h3.215Z"
                transform="translate(0 0)" />
        </g>
    </svg>`,
  },
  {
    value: 'GasWarning',
    displayText: 'Cảnh báo khí CO',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="25.413" height="16.942" viewBox="0 0 25.413 16.942">
        <path id="ic_cloud_24px"
            d="M20.489,10.4A7.934,7.934,0,0,0,5.665,8.278a6.351,6.351,0,0,0,.688,12.664H20.119A5.279,5.279,0,0,0,20.489,10.4Z"
            transform="translate(0 -4)" />
    </svg>`,
  },
  {
    value: 'Hairdryer',
    displayText: 'Máy sấy tóc',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="23.569" height="24.131" viewBox="0 0 23.569 24.131">
        <g id="Group_354" data-name="Group 354" transform="translate(0 0)">
            <g id="Group_353" data-name="Group 353" transform="translate(0 0)">
                <g id="Group_352" data-name="Group 352" transform="translate(0 0)">
                    <path id="Path_1297" data-name="Path 1297"
                        d="M371.582,10.479a.985.985,0,0,0-.956-.212l-3.963,1.563v6.977l3.959,1.565a1,1,0,0,0,.959-.211,1.276,1.276,0,0,0,.456-.986V11.463A1.276,1.276,0,0,0,371.582,10.479Z"
                        transform="translate(-348.469 -9.704)" />
                    <path id="Path_1298" data-name="Path 1298"
                        d="M185.5,255.359a13.107,13.107,0,0,1,1.2,2.557h.877v-2.684h-2.15Z"
                        transform="translate(-176.364 -242.371)" />
                    <path id="Path_1299" data-name="Path 1299"
                        d="M13.9.212a6.514,6.514,0,0,0-5.409.96A5.736,5.736,0,0,0,6.051,5.884q0,.026,0,.051a5.294,5.294,0,0,0,1.774,3.79,6.993,6.993,0,0,1,2.058,3.121l1.809,6.168a1.089,1.089,0,0,0,.269.45v1.589a2.688,2.688,0,0,0,1.075,1.259c-.009.363-.6.748-1.016.748H11.9a.7.7,0,0,1-.64-.462L8.082,14.5a1.56,1.56,0,0,0-.831-.907,1.669,1.669,0,0,0-1.311.046.537.537,0,1,0,.413.991.646.646,0,0,1,.478-.048.518.518,0,0,1,.25.31l3.171,8.091a1.762,1.762,0,0,0,1.64,1.144h.12A2.088,2.088,0,0,0,14.105,22.3V19.759l.564-1.594a3.811,3.811,0,0,0,.083-2.35.5.5,0,0,1-.086-.257,3.912,3.912,0,0,0-.514-.979l-.2-.289a4.8,4.8,0,0,1-.721-1.462l-.022-.075a1.424,1.424,0,0,1,.127-1.146,1.34,1.34,0,0,1,.834-.591C16.255,10.5,22.7,9.1,22.7,9.1h.537V2.126H22.7ZM13.57,19.837v.537H12.495v-.591a1.22,1.22,0,0,0,.346.054h.729Z"
                        transform="translate(-5.582 0.001)" />
                </g>
            </g>
        </g>
    </svg>`,
  },
  {
    value: 'FireExtinguisher',
    displayText: 'Bình cứu hỏa',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="20.111" height="26.677" viewBox="0 0 20.111 26.677">
        <g id="Group_361" data-name="Group 361" transform="translate(0 0)">
            <g id="Group_356" data-name="Group 356" transform="translate(12.944 0)">
                <g id="Group_355" data-name="Group 355">
                    <path id="Path_1300" data-name="Path 1300"
                        d="M311.448.907a4.528,4.528,0,0,1,0,4.127l7.167.907V0Z" transform="translate(-311.448)" />
                </g>
            </g>
            <g id="Group_358" data-name="Group 358" transform="translate(3.494 4.378)">
                <g id="Group_357" data-name="Group 357" transform="translate(0)">
                    <path id="Path_1301" data-name="Path 1301"
                        d="M135.5,84.016a5.479,5.479,0,0,0-5.415,4.689H140.91A5.479,5.479,0,0,0,135.5,84.016Z"
                        transform="translate(-130.081 -84.016)" />
                </g>
            </g>
            <g id="Group_360" data-name="Group 360" transform="translate(0 0.001)">
                <g id="Group_359" data-name="Group 359">
                    <path id="Path_1302" data-name="Path 1302"
                        d="M66.446,10.646v4.307a4.942,4.942,0,0,0-1.059-2.081,3.389,3.389,0,0,1-.816-2.205,6.541,6.541,0,0,1,2.5-5.146,6.5,6.5,0,0,1,7.645-1.536,2.969,2.969,0,0,0-5.4-2.434L65.294.164l-.509,1.478L68.6,2.955a8.105,8.105,0,0,0-5.591,7.71A4.953,4.953,0,0,0,64.2,13.889a3.375,3.375,0,0,1-.123,4.547l-.853.892,1.129,1.081.853-.892a4.939,4.939,0,0,0,1.239-2.281v9.458H77.387V10.646Z"
                        transform="translate(-63.007 -0.017)" />
                </g>
            </g>
        </g>
    </svg>`,
  },
  {
    value: 'DailyCleaning',
    displayText: 'Dọn phòng hàng ngày',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="18" height="21" viewBox="0 0 18 21">
        <path id="ic_assistant_24px"
            d="M19,2H5A2.006,2.006,0,0,0,3,4V18a2.006,2.006,0,0,0,2,2H9l3,3,3-3h4a2.006,2.006,0,0,0,2-2V4A2.006,2.006,0,0,0,19,2ZM13.88,12.88,12,17l-1.88-4.12L6,11l4.12-1.88L12,5l1.88,4.12L18,11Z"
            transform="translate(-3 -2)" />
    </svg>`,
  },
  {
    value: 'NearSea',
    displayText: 'Gần biển',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="17.996" height="17.999" viewBox="0 0 17.996 17.999">
        <path id="ic_beach_access_24px"
            d="M13.127,14.56l1.43-1.43L21,19.573,19.57,21ZM17.42,8.83l2.86-2.86a10.119,10.119,0,0,0-14.3-.02A11.168,11.168,0,0,1,17.42,8.83ZM5.95,5.98a10.119,10.119,0,0,0,.02,14.3l2.86-2.86A11.168,11.168,0,0,1,5.95,5.98Zm.02-.02-.01.01c-.38,3.01,1.17,6.88,4.3,10.02l5.73-5.73C12.86,7.13,8.98,5.58,5.97,5.96Z"
            transform="translate(-3.001 -3.001)" />
    </svg>`,
  },
  {
    value: 'Spa',
    displayText: 'Spa',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="18" height="21" viewBox="0 0 18 21">
        <path id="ic_local_florist_24px"
            d="M12,22a9,9,0,0,0,9-9A9,9,0,0,0,12,22ZM5.6,10.25a2.5,2.5,0,0,0,3.92,2.06l-.02.19a2.5,2.5,0,0,0,5,0l-.02-.19a2.464,2.464,0,0,0,1.42.44A2.494,2.494,0,0,0,16.97,8a2.5,2.5,0,1,0-2.49-4.31l.02-.19a2.5,2.5,0,0,0-5,0l.02.19A2.464,2.464,0,0,0,8.1,3.25,2.494,2.494,0,0,0,7.03,8,2.491,2.491,0,0,0,5.6,10.25ZM12,5.5A2.5,2.5,0,1,1,9.5,8,2.5,2.5,0,0,1,12,5.5ZM3,13a9,9,0,0,0,9,9A9,9,0,0,0,3,13Z"
            transform="translate(-3 -1)" />
    </svg>`,
  },
  {
    value: 'MeetingRoom',
    displayText: 'Phòng họp, hội nghị',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20">
        <path id="ic_voice_chat_24px"
            d="M20,2H4A2,2,0,0,0,2.01,4L2,22l4-4H20a2.006,2.006,0,0,0,2-2V4A2.006,2.006,0,0,0,20,2ZM18,14l-4-3.2V14H6V6h8V9.2L18,6Z"
            transform="translate(-2 -2)" />
    </svg>`,
  },
  {
    value: 'CurrencyExchange',
    displayText: 'Thu đổi ngoại tệ',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="10.18" height="18" viewBox="0 0 10.18 18">
        <path id="ic_attach_money_24px"
            d="M11.8,10.9c-2.27-.59-3-1.2-3-2.15,0-1.09,1.01-1.85,2.7-1.85,1.78,0,2.44.85,2.5,2.1h2.21A3.986,3.986,0,0,0,13,5.19V3H10V5.16c-1.94.42-3.5,1.68-3.5,3.61,0,2.31,1.91,3.46,4.7,4.13,2.5.6,3,1.48,3,2.41,0,.69-.49,1.79-2.7,1.79-2.06,0-2.87-.92-2.98-2.1H6.32c.12,2.19,1.76,3.42,3.68,3.83V21h3V18.85c1.95-.37,3.5-1.5,3.5-3.55C16.5,12.46,14.07,11.49,11.8,10.9Z"
            transform="translate(-6.32 -3)" />
    </svg>`,
  },
  {
    value: 'Downtown',
    displayText: 'Trung tâm thành phố',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="21.53" height="22.727" viewBox="0 0 21.53 22.727">
        <path id="ic_location_city_24px"
            d="M17.354,12.765V5.588L13.765,2,10.177,5.588V7.981H3V24.727H24.53V12.765ZM7.785,22.334H5.392V19.942H7.785Zm0-4.785H5.392V15.157H7.785Zm0-4.785H5.392V10.373H7.785Zm7.177,9.569H12.569V19.942h2.392Zm0-4.785H12.569V15.157h2.392Zm0-4.785H12.569V10.373h2.392Zm0-4.785H12.569V5.588h2.392Zm7.177,14.354H19.746V19.942h2.392Zm0-4.785H19.746V15.157h2.392Z"
            transform="translate(-3 -2)" />
    </svg>`,
  },
  {
    value: 'PetCare',
    displayText: 'Chăm coi thú cưng',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="20" height="19.004" viewBox="0 0 20 19.004">
        <g id="ic_pets_24px" transform="translate(-2 -3)">
            <circle id="Ellipse_4" data-name="Ellipse 4" cx="2.5" cy="2.5" r="2.5" transform="translate(2 7)" />
            <circle id="Ellipse_5" data-name="Ellipse 5" cx="2.5" cy="2.5" r="2.5" transform="translate(6.5 3)" />
            <circle id="Ellipse_6" data-name="Ellipse 6" cx="2.5" cy="2.5" r="2.5" transform="translate(12.5 3)" />
            <circle id="Ellipse_7" data-name="Ellipse 7" cx="2.5" cy="2.5" r="2.5" transform="translate(17 7)" />
            <path id="Path_4" data-name="Path 4"
                d="M17.34,14.86c-.87-1.02-1.6-1.89-2.48-2.91a4.243,4.243,0,0,0-1.75-1.32,2.025,2.025,0,0,0-.33-.09A5.033,5.033,0,0,0,12,10.5a4.2,4.2,0,0,0-.79.05,2.025,2.025,0,0,0-.33.09,4.308,4.308,0,0,0-1.75,1.32c-.87,1.02-1.6,1.89-2.48,2.91-1.31,1.31-2.92,2.76-2.62,4.79a3.14,3.14,0,0,0,2.33,2.32c.73.15,3.06-.44,5.54-.44h.18c2.48,0,4.81.58,5.54.44a3.155,3.155,0,0,0,2.33-2.32c.31-2.04-1.3-3.49-2.61-4.8Z" />
        </g>
    </svg>`,
  },
  {
    value: 'Casino',
    displayText: 'Casino',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18">
        <path id="ic_casino_24px"
            d="M19,3H5A2.006,2.006,0,0,0,3,5V19a2.006,2.006,0,0,0,2,2H19a2.006,2.006,0,0,0,2-2V5A2.006,2.006,0,0,0,19,3ZM7.5,18A1.5,1.5,0,1,1,9,16.5,1.5,1.5,0,0,1,7.5,18Zm0-9A1.5,1.5,0,1,1,9,7.5,1.5,1.5,0,0,1,7.5,9ZM12,13.5A1.5,1.5,0,1,1,13.5,12,1.5,1.5,0,0,1,12,13.5ZM16.5,18A1.5,1.5,0,1,1,18,16.5,1.5,1.5,0,0,1,16.5,18Zm0-9A1.5,1.5,0,1,1,18,7.5,1.5,1.5,0,0,1,16.5,9Z"
            transform="translate(-3 -3)" />
    </svg>`,
  },
  {
    value: 'WeddingCeremony',
    displayText: 'Tổ chức lễ cưới',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="22" height="14" viewBox="0 0 22 14">
        <path id="ic_group_24px"
            d="M16,11a3,3,0,1,0-3-3A2.987,2.987,0,0,0,16,11ZM8,11A3,3,0,1,0,5,8,2.987,2.987,0,0,0,8,11Zm0,2c-2.33,0-7,1.17-7,3.5V19H15V16.5C15,14.17,10.33,13,8,13Zm8,0c-.29,0-.62.02-.97.05A4.22,4.22,0,0,1,17,16.5V19h6V16.5C23,14.17,18.33,13,16,13Z"
            transform="translate(-1 -5)" />
    </svg>`,
  },
  {
    value: 'ChildCare',
    displayText: 'Dịch vụ trông trẻ',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="22" height="18" viewBox="0 0 22 18">
        <g id="ic_child_care_24px" transform="translate(-1 -3)">
            <circle id="Ellipse_24" data-name="Ellipse 24" cx="1.25" cy="1.25" r="1.25"
                transform="translate(13.25 9.25)" />
            <circle id="Ellipse_25" data-name="Ellipse 25" cx="1.25" cy="1.25" r="1.25"
                transform="translate(8.25 9.25)" />
            <path id="Path_104" data-name="Path 104"
                d="M22.94,12.66a3.66,3.66,0,0,0,0-1.32,4.008,4.008,0,0,0-2.81-3.17,9.114,9.114,0,0,0-2.19-2.91A8.991,8.991,0,0,0,3.87,8.17a3.994,3.994,0,0,0-2.81,3.17,3.66,3.66,0,0,0,0,1.32,4.008,4.008,0,0,0,2.81,3.17,8.977,8.977,0,0,0,2.17,2.89,8.943,8.943,0,0,0,11.93,0,9.086,9.086,0,0,0,2.17-2.89,4,4,0,0,0,2.8-3.17ZM19,14a2.851,2.851,0,0,1-.29-.03,7.168,7.168,0,0,1-.86,1.86,6.983,6.983,0,0,1-11.7,0,7.168,7.168,0,0,1-.86-1.86A2.85,2.85,0,0,1,5,14a2,2,0,0,1,0-4,2.851,2.851,0,0,1,.29.03,7.168,7.168,0,0,1,.86-1.86,6.983,6.983,0,0,1,11.7,0,7.168,7.168,0,0,1,.86,1.86A2.85,2.85,0,0,1,19,10a2,2,0,0,1,0,4ZM7.5,14a4.875,4.875,0,0,0,9,0Z" />
        </g>
    </svg>`,
  },
  {
    value: 'CarRental',
    displayText: 'Thuê xe tự lái',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="18" height="16" viewBox="0 0 18 16">
        <path id="ic_directions_car_24px"
            d="M18.92,6.01A1.494,1.494,0,0,0,17.5,5H6.5A1.5,1.5,0,0,0,5.08,6.01L3,12v8a1,1,0,0,0,1,1H5a1,1,0,0,0,1-1V19H18v1a1,1,0,0,0,1,1h1a1,1,0,0,0,1-1V12ZM6.5,16A1.5,1.5,0,1,1,8,14.5,1.5,1.5,0,0,1,6.5,16Zm11,0A1.5,1.5,0,1,1,19,14.5,1.5,1.5,0,0,1,17.5,16ZM5,11,6.5,6.5h11L19,11Z"
            transform="translate(-3 -5)" />
    </svg>`,
  },
  {
    value: 'TicketBooking',
    displayText: 'Đặt vé máy bay, tour DL',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="19" height="20" viewBox="0 0 19 20">
        <path id="ic_local_airport_24px"
            d="M21,16V14L13,9V3.5a1.5,1.5,0,0,0-3,0V9L2,14v2l8-2.5V19L8,20.5V22l3.5-1L15,22V20.5L13,19V13.5Z"
            transform="translate(-2 -2)" />
    </svg>`,
  },
  {
    value: 'Tennis',
    displayText: 'Sân Tennis',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="19.777" height="18.157" viewBox="0 0 19.777 18.157">
        <g id="Group_10757" data-name="Group 10757" transform="translate(-828.344 -848)">
            <path id="ic_restaurant_menu_24px"
                d="M3.91,9.16Zm10.97,2.37a4.862,4.862,0,0,0,5.27-1.38c1.91-1.91,2.28-4.65.81-6.12s-4.2-1.1-6.12.81a4.862,4.862,0,0,0-1.38,5.27L3.7,19.87l1.41,1.41L12,14.41l6.88,6.88,1.41-1.41L13.41,13l1.47-1.47Z"
                transform="translate(826.26 844.867)" />
            <path id="ic_restaurant_menu_24px-2" data-name="ic_restaurant_menu_24px"
                d="M9.739,11.53a4.883,4.883,0,0,1-5.283-1.38C2.54,8.24,2.169,5.5,3.643,4.03s4.211-1.1,6.136.81a4.854,4.854,0,0,1,1.384,5.27l9.785,9.76-1.414,1.41-6.907-6.87-6.9,6.88L4.315,19.88l6.9-6.88L9.739,11.53Z"
                transform="translate(825.604 844.867)" />
        </g>
    </svg>`,
  },
  {
    value: 'SouvenirStore',
    displayText: 'Cửa hàng lưu niệm',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="18" height="16" viewBox="0 0 18 16">
        <path id="ic_store_mall_directory_24px"
            d="M20,4H4V6H20Zm1,10V12L20,7H4L3,12v2H4v6H14V14h4v6h2V14Zm-9,4H6V14h6Z" transform="translate(-3 -4)" />
    </svg>`,
  },
  {
    value: 'SaunaRoom',
    displayText: 'Phòng xông hơi',
    icon: `<svg class="me-3" xmlns="http://www.w3.org/2000/svg" width="16.91" height="21.9" viewBox="0 0 16.91 21.9">
        <path id="ic_wb_iridescent_24px"
            d="M5,14.5H19v-6H5ZM11,.55V3.5h2V.55Zm8.04,2.5L17.25,4.84l1.41,1.41,1.8-1.79L19.04,3.05ZM13,22.45V19.5H11v2.95Zm7.45-3.91-1.8-1.79-1.41,1.41,1.79,1.8,1.42-1.42ZM3.55,4.46,5.34,6.25,6.75,4.84,4.96,3.05,3.55,4.46ZM4.96,19.95l1.79-1.8L5.34,16.74,3.55,18.53l1.41,1.42Z"
            transform="translate(-3.55 -0.55)" />
    </svg>`,
  },
];
